tap "aws/tap"

brew "ast-grep"
brew "aws-sam-cli"
brew "awscli"
brew "awscurl"
brew "bat"
brew "difftastic"
brew "duck"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "graphviz"
brew "helix"
brew "html-xml-utils"
brew "htop"
brew "ipython"
brew "jdtls"
brew "jq"
brew "lsd"
brew "midnight-commander"
brew "mise"
brew "mosh"
brew "neovim"
brew "nnn"
brew "libpq"
brew "pyright"
brew "ranger"
brew "ripgrep"
brew "ruff"
brew "shellcheck"
brew "sloccount"
brew "telnet"
brew "tig"
brew "tldr"
brew "tmux"
brew "tree"
brew "typescript-language-server"
brew "unison"
brew "uv"
brew "vifm"
brew "wget"
brew "z"

cask "alt-tab"
cask "dbeaver-community"
cask "ghostty"
cask "kitty"
cask "marta"
cask "shortcat"

vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
